adamkondraciuk/nrfx/mdk/nrf9120_modem.h
/*
 * Copyright (c) 2016, Nordic Semiconductor ASA
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 
 * * Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 * 
 * * Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 * 
 * * Neither the name of Nordic Semiconductor ASA nor the names of its
 * contributors may be used to endorse or promote products derived from
 * this software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     nrf9120_modem.h
 * @brief    CMSIS HeaderFile
 * @version  1
 * @date     06. June 2018
 * @note     Generated by SVDConv V3.3.18 on Wednesday, 06.06.2018 15:24:43
 *           from File 'nrf9120_modem.svd',
 *           last modified on Wednesday, 06.06.2018 13:24:37
 */



/** @addtogroup Nordic Semiconductor
  * @{
  */


/** @addtogroup nrf9120_modem
  * @{
  */


#ifndef NRF9120_MODEM_H
#define NRF9120_MODEM_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M4 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =======================================  nrf9120_modem Specific Interrupt Numbers  ======================================== */
  MWU_IRQn                  =   1,              /*!< 1  MWU                                                                    */
  MCPLL_IRQn                =  16,              /*!< 16 MCPLL                                                                  */
  RCOSC32K_IRQn             =  18,              /*!< 18 RCOSC32K                                                               */
  CLOCK_POWER_IRQn          =  21,              /*!< 21 CLOCK_POWER                                                            */
  UARTE_IRQn                =  35,              /*!< 35 UARTE                                                                  */
  TIMER1_IRQn               =  36,              /*!< 36 TIMER1                                                                 */
  TIMER11_IRQn              =  37,              /*!< 37 TIMER11                                                                */
  RTC_IRQn                  =  38,              /*!< 38 RTC                                                                    */
  LWDT_IRQn                 =  39,              /*!< 39 LWDT                                                                   */
  SWDT_IRQn                 =  40,              /*!< 40 SWDT                                                                   */
  RNG_IRQn                  =  41,              /*!< 41 RNG                                                                    */
  SIMIF_IRQn                =  42,              /*!< 42 SIMIF                                                                  */
  M2M0_IRQn                 =  46,              /*!< 46 M2M0                                                                   */
  M2M1_IRQn                 =  47,              /*!< 47 M2M1                                                                   */
  GPIOTE0_IRQn              =  48,              /*!< 48 GPIOTE0                                                                */
  GPIOTE1_IRQn              =  49,              /*!< 49 GPIOTE1                                                                */
  GPIOTE2_IRQn              =  55,              /*!< 55 GPIOTE2                                                                */
  TEMP_IRQn                 =  57,              /*!< 57 TEMP                                                                   */
  LFCLKCALIBMEAS_IRQn       =  59,              /*!< 59 LFCLKCALIBMEAS                                                         */
  TWIM_IRQn                 =  60,              /*!< 60 TWIM                                                                   */
  AESL2_IRQn                =  66,              /*!< 66 AESL2                                                                  */
  SNOW_IRQn                 =  67,              /*!< 67 SNOW                                                                   */
  ZUC_IRQn                  =  68,              /*!< 68 ZUC                                                                    */
  SHA_IRQn                  =  80,              /*!< 80 SHA                                                                    */
  TLSAES_IRQn               =  81,              /*!< 81 TLSAES                                                                 */
  DESCIPHER_IRQn            =  82,              /*!< 82 DESCIPHER                                                              */
  IPC_IRQn                  =  83,              /*!< 83 IPC                                                                    */
  IPC1_IRQn                 =  84,              /*!< 84 IPC1                                                                   */
  IPC2_IRQn                 =  85,              /*!< 85 IPC2                                                                   */
  TIMER0_IRQn               =  86,              /*!< 86 TIMER0                                                                 */
  TIMER01_IRQn              =  87,              /*!< 87 TIMER01                                                                */
  KMU_IRQn                  =  96               /*!< 96 KMU                                                                    */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M4 Processor and Core Peripherals  =========================== */
#define __CM4_REV                 0x0001U       /*!< CM4 Core Revision                                                         */
#define __NVIC_PRIO_BITS               3        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  1        /*!< MPU present or not                                                        */
#define __FPU_PRESENT                  1        /*!< FPU present or not                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                           /*!< ARM Cortex-M4 processor and core peripherals                              */
#include "system_nrf9120_modem.h"               /*!< nrf9120_modem System                                                      */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* =========================================================================================================================== */
/* ================                              Device Specific Cluster Section                              ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_clusters
  * @{
  */


/**
  * @brief FICR_INFO [INFO] (Device info)
  */
typedef struct {
  __IM  uint32_t  CONFIGID;                     /*!< (@ 0x00000000) Configuration identifier                                   */
  __IM  uint32_t  DEVICEID[2];                  /*!< (@ 0x00000004) Description collection: Device identifier                  */
  __IM  uint32_t  PART;                         /*!< (@ 0x0000000C) Part code                                                  */
  __IM  uint32_t  VARIANT;                      /*!< (@ 0x00000010) Part Variant, Hardware version and Production
                                                                    configuration                                              */
  __IM  uint32_t  PACKAGE;                      /*!< (@ 0x00000014) Package option                                             */
  __IM  uint32_t  RAM;                          /*!< (@ 0x00000018) RAM variant                                                */
  __IM  uint32_t  FLASH;                        /*!< (@ 0x0000001C) Flash variant                                              */
  __IM  uint32_t  CODEPAGESIZE;                 /*!< (@ 0x00000020) Code memory page size                                      */
  __IM  uint32_t  CODESIZE;                     /*!< (@ 0x00000024) Code memory size                                           */
  __IM  uint32_t  DEVICETYPE;                   /*!< (@ 0x00000028) Device type                                                */
} FICR_INFO_Type;                               /*!< Size = 44 (0x2c)                                                          */


/**
  * @brief AMLI_RAMPRI [RAMPRI] (RAM configurable priority configuration structure)
  */
typedef struct {
  __IOM uint32_t  CPU;                          /*!< (@ 0x00000000) AHB bus master priority register for CPU                   */
  __IOM uint32_t  EXTRAM[1];                    /*!< (@ 0x00000004) Description collection: AHB bus master priority
                                                                    register for external RAM slave port (EXTRAMs)             */
} AMLI_RAMPRI_Type;                             /*!< Size = 8 (0x8)                                                            */


/**
  * @brief DCNF_EXTPERI0 [EXTPERI0] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PROTECT[2];                   /*!< (@ 0x00000000) Description collection: Control access for Master
                                                                    connected to AMLI master port EXTPERI[n]                   */
} DCNF_EXTPERI0_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
  * @brief DCNF_EXTRAM [EXTRAM] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PROTECT[2];                   /*!< (@ 0x00000000) Description collection: Control access from Master
                                                                    connected to AMLI master port EXTRAM[n]                    */
} DCNF_EXTRAM_Type;                             /*!< Size = 8 (0x8)                                                            */


/**
  * @brief DCNF_EXTCODE [EXTCODE] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PROTECT;                      /*!< (@ 0x00000000) Description cluster: Control access from Master
                                                                    connected to AMLI master port EXTCODE[n]                   */
} DCNF_EXTCODE_Type;                            /*!< Size = 4 (0x4)                                                            */


/**
  * @brief TRACEANDDEBUG_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  TRACECLK;                     /*!< (@ 0x00000000) Pin number configuration for TraceClk signal               */
  __IOM uint32_t  TRACEDATA0;                   /*!< (@ 0x00000004) Pin number configuration for TraceData0 signal             */
  __IOM uint32_t  TRACEDATA1;                   /*!< (@ 0x00000008) Pin number configuration for TraceData1 signal             */
  __IOM uint32_t  TRACEDATA2;                   /*!< (@ 0x0000000C) Pin number configuration for TraceData2 signal             */
  __IOM uint32_t  TRACEDATA3;                   /*!< (@ 0x00000010) Pin number configuration for TraceData3 signal             */
} TRACEANDDEBUG_PSEL_Type;                      /*!< Size = 20 (0x14)                                                          */


/**
  * @brief MWU_EVENTS_REGION [EVENTS_REGION] (Peripheral events.)
  */
typedef struct {
  __IOM uint32_t  WA;                           /*!< (@ 0x00000000) Description cluster: Write access to region n
                                                                    detected                                                   */
  __IOM uint32_t  RA;                           /*!< (@ 0x00000004) Description cluster: Read access to region n
                                                                    detected                                                   */
} MWU_EVENTS_REGION_Type;                       /*!< Size = 8 (0x8)                                                            */


/**
  * @brief MWU_REGION [REGION] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  START;                        /*!< (@ 0x00000000) Description cluster: Start address for region
                                                                    n                                                          */
  __IOM uint32_t  END;                          /*!< (@ 0x00000004) Description cluster: End address of region n               */
  __IM  uint32_t  RESERVED[2];
} MWU_REGION_Type;                              /*!< Size = 16 (0x10)                                                          */


/**
  * @brief MCPLL_CONTROL [CONTROL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  INT;                          /*!< (@ 0x00000000) Integer part of the control word.                          */
  __IOM uint32_t  FRAC;                         /*!< (@ 0x00000004) Fractional part of the control word.                       */
} MCPLL_CONTROL_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
  * @brief MCPLL_OVERRIDE [OVERRIDE] (Override mechanism)
  */
typedef struct {
  __IOM uint32_t  MCPLL;                        /*!< (@ 0x00000000) Override for MCPLL power switch                            */
  __IOM uint32_t  MCPLLBUF;                     /*!< (@ 0x00000004) Override for MCPLLBUF power switch                         */
  __IOM uint32_t  PWRUP;                        /*!< (@ 0x00000008) Override for power up                                      */
} MCPLL_OVERRIDE_Type;                          /*!< Size = 12 (0xc)                                                           */


/**
  * @brief POWER_DSP [DSP] (Control register for DSP)
  */
typedef struct {
  __IOM uint32_t  RESET;                        /*!< (@ 0x00000000) Reset DSP subsystem                                        */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  FORCEON;                      /*!< (@ 0x00000008) Force on power and clock in DSP subsystem                  */
  __IOM uint32_t  HALT;                         /*!< (@ 0x0000000C) Halt DSP subsystem                                         */
} POWER_DSP_Type;                               /*!< Size = 16 (0x10)                                                          */


/**
  * @brief POWER_LYNX [LYNX] (Control register for Lynx RF subsystem)
  */
typedef struct {
  __IOM uint32_t  RESET;                        /*!< (@ 0x00000000) Reset Lynx RF subsystem                                    */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  FORCEON;                      /*!< (@ 0x00000008) Force on Lynx RF subsystem                                 */
} POWER_LYNX_Type;                              /*!< Size = 12 (0xc)                                                           */


/**
  * @brief UARTE_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  RTS;                          /*!< (@ 0x00000000) Pin select for RTS signal                                  */
  __IOM uint32_t  TXD;                          /*!< (@ 0x00000004) Pin select for TXD signal                                  */
  __IOM uint32_t  CTS;                          /*!< (@ 0x00000008) Pin select for CTS signal                                  */
  __IOM uint32_t  RXD;                          /*!< (@ 0x0000000C) Pin select for RXD signal                                  */
} UARTE_PSEL_Type;                              /*!< Size = 16 (0x10)                                                          */


/**
  * @brief UARTE_RXD [RXD] (RXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
} UARTE_RXD_Type;                               /*!< Size = 12 (0xc)                                                           */


/**
  * @brief UARTE_TXD [TXD] (TXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
} UARTE_TXD_Type;                               /*!< Size = 12 (0xc)                                                           */


/**
  * @brief M2M_IN [IN] (Memory to memory input channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of bytes in input and output buffer         */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
  __IOM uint32_t  LIST;                         /*!< (@ 0x0000000C) EasyDMA list type                                          */
} M2M_IN_Type;                                  /*!< Size = 16 (0x10)                                                          */


/**
  * @brief M2M_OUT [OUT] (Memory to memory output channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000004) Number of bytes transferred in the last transaction        */
  __IOM uint32_t  LIST;                         /*!< (@ 0x00000008) EasyDMA list type                                          */
} M2M_OUT_Type;                                 /*!< Size = 12 (0xc)                                                           */


/**
  * @brief GPIO_PIN [PIN] (Pin n direct access)
  */
typedef struct {
  __IOM uint32_t  OUT;                          /*!< (@ 0x00000000) Description cluster: Pin n direct access output
                                                                    register                                                   */
  __IM  uint32_t  IN;                           /*!< (@ 0x00000004) Description cluster: Pin n direct access input
                                                                    register                                                   */
} GPIO_PIN_Type;                                /*!< Size = 8 (0x8)                                                            */


/**
  * @brief TWIM_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;                          /*!< (@ 0x00000000) Pin select for SCL signal                                  */
  __IOM uint32_t  SDA;                          /*!< (@ 0x00000004) Pin select for SDA signal                                  */
} TWIM_PSEL_Type;                               /*!< Size = 8 (0x8)                                                            */


