adamkondraciuk/nrfx/mdk/nrf9120_modem.h
/**
  * @brief TWIM_RXD [RXD] (RXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
  __IOM uint32_t  LIST;                         /*!< (@ 0x0000000C) EasyDMA list type                                          */
} TWIM_RXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief TWIM_TXD [TXD] (TXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< (@ 0x00000000) Data pointer                                               */
  __IOM uint32_t  MAXCNT;                       /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
  __IM  uint32_t  AMOUNT;                       /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
  __IOM uint32_t  LIST;                         /*!< (@ 0x0000000C) EasyDMA list type                                          */
} TWIM_TXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief ACL_ACL [ACL] (Unspecified)
  */
typedef struct {
  __OM  uint32_t  ADDR;                         /*!< (@ 0x00000000) Description cluster: Configure the word-aligned
                                                                    start address of region n to protect                       */
  __OM  uint32_t  SIZE;                         /*!< (@ 0x00000004) Description cluster: Size of region to protect
                                                                    counting from address ACL[n].ADDR. Write
                                                                    '0' as no effect.                                          */
  __OM  uint32_t  PERM;                         /*!< (@ 0x00000008) Description cluster: Access permissions for region
                                                                    n as defined by start address ACL[n].ADDR
                                                                    and size ACL[n].SIZE                                       */
  __IM  uint32_t  RESERVED;
} ACL_ACL_Type;                                 /*!< Size = 16 (0x10)                                                          */


/**
  * @brief VMC_RAM [RAM] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAMn power control register           */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAMn power control set register       */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAMn power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAM_Type;                                 /*!< Size = 16 (0x10)                                                          */


/**
  * @brief VMC_RAMB [RAMB] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAM Bn power control register         */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAM Bn power control set
                                                                    register                                                   */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAM Bn power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAMB_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief VMC_RAMC [RAMC] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAM Cn power control register         */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAM Cn power control set
                                                                    register                                                   */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAM Cn power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAMC_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief VMC_RAMD [RAMD] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< (@ 0x00000000) Description cluster: RAM Dn power control register         */
  __OM  uint32_t  POWERSET;                     /*!< (@ 0x00000004) Description cluster: RAM Dn power control set
                                                                    register                                                   */
  __OM  uint32_t  POWERCLR;                     /*!< (@ 0x00000008) Description cluster: RAM Dn power control clear
                                                                    register                                                   */
  __IM  uint32_t  RESERVED;
} VMC_RAMD_Type;                                /*!< Size = 16 (0x10)                                                          */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          FICR_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Factory Information Configuration Registers (FICR_NS)
  */

typedef struct {                                /*!< (@ 0x00FF0000) FICR_NS Structure                                          */
  __IM  uint32_t  RESERVED[64];
  __IM  uint32_t  TESTSTATUS;                   /*!< (@ 0x00000100) Code memory test status. Will be set during production
                                                                    test.                                                      */
  __IM  uint32_t  CPTEST0;                      /*!< (@ 0x00000104) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST00;                     /*!< (@ 0x00000108) Result from Circuit Probe test                             */
  __IM  uint32_t  RESERVED1;
  __IM  uint32_t  CPTEST1;                      /*!< (@ 0x00000110) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST2;                      /*!< (@ 0x00000114) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST3;                      /*!< (@ 0x00000118) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST4;                      /*!< (@ 0x0000011C) Result from Circuit Probe test                             */
  __IM  uint32_t  CPTEST5;                      /*!< (@ 0x00000120) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  CPTEST6;                      /*!< (@ 0x00000124) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  CPTEST7;                      /*!< (@ 0x00000128) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  CPTEST8;                      /*!< (@ 0x0000012C) Result from Circuit Probe test, flash repair
                                                                    information                                                */
  __IM  uint32_t  RESERVED2[52];
  __IOM FICR_INFO_Type INFO;                    /*!< (@ 0x00000200) Device info                                                */
  __IM  uint32_t  RESERVED3[7];
  __IM  uint32_t  CHIPCONF02;                   /*!< (@ 0x00000248) Miscellaneous modem HW configuration. Will be
                                                                    set during production test.                                */
  __IM  uint32_t  CHIPCONF03;                   /*!< (@ 0x0000024C) Miscellaneous modem HW configuration.                      */
  __IOM uint32_t  CHIPCONF04;                   /*!< (@ 0x00000250) MODEM M4 VMC SRAMTRIM values                               */
  __IOM uint32_t  CHIPCONF05;                   /*!< (@ 0x00000254) MODEM M4 VMC RamSSNonRetTSel timing control values
                                                                    for TSMC RAMs                                              */
  __IOM uint32_t  CHIPCONF06;                   /*!< (@ 0x00000258) MODEM DSP SRAMTRIM values                                  */
  __IOM uint32_t  CHIPCONF07;                   /*!< (@ 0x0000025C) MODEM RF VMC SRAMTRIM values                               */
  __IM  uint32_t  RESERVED4[8];
  __IM  uint32_t  FLASHPWRUP0;                  /*!< (@ 0x00000280) Power-up pattern for flash                                 */
  __IM  uint32_t  FLASHPWRUP1;                  /*!< (@ 0x00000284) Power-up pattern for flash                                 */
  __IM  uint32_t  RESERVED5[350];
  __IM  uint32_t  PRODTEST[3];                  /*!< (@ 0x00000800) Description collection: Production test control
                                                                    n                                                          */
} NRF_FICR_Type;                                /*!< Size = 2060 (0x80c)                                                       */



/* =========================================================================================================================== */
/* ================                                          UICR_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief User Information Configuration Registers (UICR_NS)
  */

