adamkondraciuk/nrfx/mdk/nrf9120_modem.h
typedef struct {                                /*!< (@ 0x00FF8000) UICR_NS Structure                                          */
  __IM  uint32_t  APPROTECT;                    /*!< (@ 0x00000000) Access Port protection                                     */
  __IM  uint32_t  ERASEPROTECT;                 /*!< (@ 0x00000004) Flash erase protection                                     */
  __IM  uint32_t  ACLREGION0ADDR;               /*!< (@ 0x00000008) ACL region0 address. Value will get inverted
                                                                    in the readout process before writing the
                                                                    value to ACL.                                              */
  __IM  uint32_t  ACLREGION0SIZE;               /*!< (@ 0x0000000C) ACL region0 size. Value will get inverted in
                                                                    the readout process before writing the value
                                                                    to ACL.                                                    */
  __IM  uint32_t  ACLREGION0PERM;               /*!< (@ 0x00000010) ACL region0 permissions. Value will get inverted
                                                                    in the readout process before writing the
                                                                    value to ACL.                                              */
  __IM  uint32_t  ACLREGION1ADDR;               /*!< (@ 0x00000014) ACL region1 address. Value will get inverted
                                                                    in the readout process before writing the
                                                                    value to ACL.                                              */
  __IM  uint32_t  ACLREGION1SIZE;               /*!< (@ 0x00000018) ACL region1 size. Value will get inverted in
                                                                    the readout process before writing the value
                                                                    to ACL.                                                    */
  __IM  uint32_t  ACLREGION1PERM;               /*!< (@ 0x0000001C) ACL region1 permissions. Value will get inverted
                                                                    in the readout process before writing the
                                                                    value to ACL.                                              */
  __IM  uint32_t  RESERVED[56];
  __IOM uint32_t  MDMNVMCPOFGUARD;              /*!< (@ 0x00000100) Enable blocking NVM WRITE and aborting NVM ERASE
                                                                    for LTE-Modem NVM in POFWARN condition.                    */
  __IOM uint32_t  PKEYREVOKED;                  /*!< (@ 0x00000104) Private key revoked status.                                */
  __IOM uint32_t  UARTBLOCK;                    /*!< (@ 0x00000108) Modem UART RXD TXD blocking.                               */
  __IM  uint32_t  RESERVED1[189];
  __IM  uint32_t  KEYSLOT1DEST;                 /*!< (@ 0x00000400) KEYSLOT1 destination address                               */
  __IM  uint32_t  KEYSLOT1CONFIG;               /*!< (@ 0x00000404) KEYSLOT1 configuration                                     */
  __IM  uint32_t  RESERVED2[254];
  __IM  uint32_t  KEYSLOT1KEYVALUE0;            /*!< (@ 0x00000800) KEYSLOT1 key bits [31:0]                                   */
  __IM  uint32_t  KEYSLOT1KEYVALUE1;            /*!< (@ 0x00000804) KEYSLOT1 key bits [63:32]                                  */
  __IM  uint32_t  KEYSLOT1KEYVALUE2;            /*!< (@ 0x00000808) KEYSLOT1 key bits [95:64]                                  */
  __IM  uint32_t  KEYSLOT1KEYVALUE3;            /*!< (@ 0x0000080C) KEYSLOT1 key bits [127:96]                                 */
} NRF_UICR_Type;                                /*!< Size = 2064 (0x810)                                                       */



/* =========================================================================================================================== */
/* ================                                     TRACEDELAYREG_NS                                      ================ */
/* =========================================================================================================================== */


/**
  * @brief Trace delay register (TRACEDELAYREG_NS)
  */

typedef struct {                                /*!< (@ 0xD0000000) TRACEDELAYREG_NS Structure                                 */
  __IM  uint32_t  RESERVED[321];
  __IOM uint32_t  DELAY_REG_CONFIG;             /*!< (@ 0x00000504) Configuration register for DELAY_REG delay                 */
  __IM  uint32_t  RESERVED1[62];
  __OM  uint32_t  DELAY_REG;                    /*!< (@ 0x00000600) Dummy register with adjustable write delay. Occupies
                                                                    0x100 address range i.e. 256bytes                          */
} NRF_TRACEDELAYREG_Type;                       /*!< Size = 1540 (0x604)                                                       */



/* =========================================================================================================================== */
/* ================                                          AMLI_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief AHB Multi-Layer Interface (AMLI_NS)
  */

typedef struct {                                /*!< (@ 0x40000000) AMLI_NS Structure                                          */
  __IM  uint32_t  RESERVED[896];
  __IOM AMLI_RAMPRI_Type RAMPRI;                /*!< (@ 0x00000E00) RAM configurable priority configuration structure          */
} NRF_AMLI_Type;                                /*!< Size = 3592 (0xe08)                                                       */



/* =========================================================================================================================== */
/* ================                                          DCNF_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Domain Configuration Management (DCNF_NS)
  */

