adamkondraciuk/nrfx/mdk/nrf9120_modem.h
typedef struct {                                /*!< (@ 0x40030000) GPIOTE0_NS Structure                                       */
  __OM  uint32_t  TASKS_OUT[1];                 /*!< (@ 0x00000000) Description collection: Task for writing to pin
                                                                    specified in CONFIG[n].PSEL. Action on pin
                                                                    is configured in CONFIG[n].POLARITY.                       */
  __IM  uint32_t  RESERVED[11];
  __OM  uint32_t  TASKS_SET[1];                 /*!< (@ 0x00000030) Description collection: Task for writing to pin
                                                                    specified in CONFIG[n].PSEL. Action on pin
                                                                    is to set it high.                                         */
  __IM  uint32_t  RESERVED1[11];
  __OM  uint32_t  TASKS_CLR[1];                 /*!< (@ 0x00000060) Description collection: Task for writing to pin
                                                                    specified in CONFIG[n].PSEL. Action on pin
                                                                    is to set it low.                                          */
  __IM  uint32_t  RESERVED2[7];
  __IOM uint32_t  SUBSCRIBE_OUT;                /*!< (@ 0x00000080) Subscribe configuration for TASKS_OUT                      */
  __IOM uint32_t  SUBSCRIBE_SET;                /*!< (@ 0x00000084) Subscribe configuration for TASKS_SET                      */
  __IOM uint32_t  SUBSCRIBE_CLR;                /*!< (@ 0x00000088) Subscribe configuration for TASKS_CLR                      */
  __IM  uint32_t  RESERVED3[29];
  __IOM uint32_t  EVENTS_IN[1];                 /*!< (@ 0x00000100) Description collection: Event generated from
                                                                    pin specified in CONFIG[n].PSEL                            */
  __IM  uint32_t  RESERVED4[30];
  __IOM uint32_t  EVENTS_PORT;                  /*!< (@ 0x0000017C) Event generated from multiple input GPIO pins
                                                                    with SENSE mechanism enabled                               */
  __IOM uint32_t  PUBLISH_IN;                   /*!< (@ 0x00000180) Publish configuration for EVENTS_IN                        */
  __IM  uint32_t  RESERVED5[30];
  __IOM uint32_t  PUBLISH_PORT;                 /*!< (@ 0x000001FC) Publish configuration for EVENTS_IN                        */
  __IM  uint32_t  RESERVED6[64];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED7[129];
  __IOM uint32_t  CONFIG[1];                    /*!< (@ 0x00000510) Description collection: Configuration for OUT[n],
                                                                    SET[n] and CLR[n] tasks and IN[n] event                    */
  __IM  uint32_t  RESERVED8[59];
  __IOM uint32_t  DEBOUNCE[1];                  /*!< (@ 0x00000600) Description collection: Debounce mode for GPIOTE
                                                                    channel n                                                  */
} NRF_GPIOTE_Type;                              /*!< Size = 1540 (0x604)                                                       */



/* =========================================================================================================================== */
/* ================                                       SECCONTROL_NS                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Secure Control (SECCONTROL_NS)
  */

typedef struct {                                /*!< (@ 0x40032000) SECCONTROL_NS Structure                                    */
  __IM  uint32_t  RESERVED[256];
  __OM  uint32_t  OTPTOPADDR;                   /*!< (@ 0x00000400) Top address of the OTP area. Address must be
                                                                    divisible by four                                          */
  __OM  uint32_t  SECUREEXIT;                   /*!< (@ 0x00000404) Writing to this register will enable secure exit.          */
  __IOM uint32_t  SNOOPENABLE;                  /*!< (@ 0x00000408) Enable SecureEntry snooping.                               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  AESDMAPROMOTION;              /*!< (@ 0x00000410) AES DMA promoted as a secure device.                       */
  __IOM uint32_t  SHADMAPROMOTION;              /*!< (@ 0x00000414) SHA DMA promoted as a secure device.                       */
  __IOM uint32_t  SECUREWATCHDOGPAUSE;          /*!< (@ 0x00000418) Secure watchdog pause control.                             */
  __IOM uint32_t  KMUENA;                       /*!< (@ 0x0000041C) SICR erase protection.                                     */
  __IOM uint32_t  RAMWAITSTATE;                 /*!< (@ 0x00000420) Modem M4 RAM wait state configuration.                     */
} NRF_SECURECONTROL_Type;                       /*!< Size = 1060 (0x424)                                                       */



/* =========================================================================================================================== */
/* ================                                      TIMEMARKMUX_NS                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Timemark multiplexer for LTE System Timer (TIMEMARKMUX_NS)
  */

