adamkondraciuk/nrfx/mdk/nrf9120_modem.h
typedef struct {                                /*!< (@ 0x40043000) SNOW_NS Structure                                          */
  __OM  uint32_t  TASKS_STARTGATHER;            /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOPGATHER;             /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_STARTSCATTER;           /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOPSCATTER;            /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZESNOW3G;       /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_STARTOPERATION;         /*!< (@ 0x00000014) Start cipher / MAC calculation depending on MODE           */
  __OM  uint32_t  TASKS_FINALIZEMAC;            /*!< (@ 0x00000018) Finalize MAC calculation                                   */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x0000001C) Stop all transfers and crypto operations (initialize)      */
  __IM  uint32_t  RESERVED[56];
  __IOM uint32_t  EVENTS_GATHERSTARTED;         /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHERDONE;            /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTERSTARTED;        /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTERDONE;           /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_IVREADY;               /*!< (@ 0x00000110) IV received (ivbytes == 16)                                */
  __IOM uint32_t  EVENTS_SNOW3GINITIALIZED;     /*!< (@ 0x00000114) New keys and IV taken into use                             */
  __IOM uint32_t  EVENTS_MESSAGEREADY;          /*!< (@ 0x00000118) LENGTH == 0                                                */
  __IOM uint32_t  EVENTS_MACREADY;              /*!< (@ 0x0000011C) MAC calculated                                             */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000120) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED1[55];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[66];
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED3[60];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Keystream length in bits (Cipher), message length
                                                                    in bits (MAC)                                              */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode select                                                */
  __IM  uint32_t  RESERVED4[126];
  __IM  uint32_t  MAC;                          /*!< (@ 0x00000600) Message Authentication Code.                               */
  __IM  uint32_t  RESERVED5[127];
  __IOM uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Input job pointer                                          */
  __IM  uint32_t  RESERVED6[63];
  __IOM uint32_t  OUTJOBPTR;                    /*!< (@ 0x00000900) Output job pointer                                         */
} NRF_SNOW_Type;                                /*!< Size = 2308 (0x904)                                                       */



/* =========================================================================================================================== */
/* ================                                          ZUC_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief ZUC LTE L2 security IP (ZUC_NS)
  */

typedef struct {                                /*!< (@ 0x40044000) ZUC_NS Structure                                           */
  __OM  uint32_t  TASKS_STARTGATHER;            /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOPGATHER;             /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_STARTSCATTER;           /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOPSCATTER;            /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZEZUC;          /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_STARTOPERATION;         /*!< (@ 0x00000014) Start cipher / MAC calculation depending on MODE           */
  __OM  uint32_t  TASKS_FINALIZEMAC;            /*!< (@ 0x00000018) Finalize MAC calculation                                   */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x0000001C) Stop all transfers and crypto operations (initialize)      */
  __IM  uint32_t  RESERVED[56];
  __IOM uint32_t  EVENTS_GATHERSTARTED;         /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHERDONE;            /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTERSTARTED;        /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTERDONE;           /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_IVREADY;               /*!< (@ 0x00000110) IV received (ivbytes == 16)                                */
  __IOM uint32_t  EVENTS_ZUCINITIALIZED;        /*!< (@ 0x00000114) New keys and IV taken into use                             */
  __IOM uint32_t  EVENTS_MESSAGEREADY;          /*!< (@ 0x00000118) LENGTH == 0                                                */
  __IOM uint32_t  EVENTS_MACREADY;              /*!< (@ 0x0000011C) MAC calculated                                             */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000120) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED1[55];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED3[60];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Keystream length in bits (Cipher), message length
                                                                    in bits (MAC)                                              */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode select                                                */
  __IM  uint32_t  RESERVED4[126];
  __IM  uint32_t  MAC;                          /*!< (@ 0x00000600) Message Authentication Code.                               */
  __IM  uint32_t  RESERVED5[127];
  __IOM uint32_t  INDCP_MEMORY_ADDR;            /*!< (@ 0x00000800) Pointer to input DMA scatter and gather job list
                                                                    (Write) / current output job address (Read)                */
  __IM  uint32_t  RESERVED6[63];
  __IOM uint32_t  OUTDCP_MEMORY_ADDR;           /*!< (@ 0x00000900) Pointer to output DMA scatter and gather job
                                                                    list (Write) / current output job address
                                                                    (Read)                                                     */
} NRF_ZUC_Type;                                 /*!< Size = 2308 (0x904)                                                       */



/* =========================================================================================================================== */
/* ================                                          SHA_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SHA-1/SHA-256 (SHA_NS)
  */

typedef struct {                                /*!< (@ 0x40050000) SHA_NS Structure                                           */
  __OM  uint32_t  TASKS_START_GATHER;           /*!< (@ 0x00000000) Start input DMA.                                           */
  __OM  uint32_t  TASKS_STOP_GATHER;            /*!< (@ 0x00000004) Stop input DMA.                                            */
  __OM  uint32_t  TASKS_START_OPERATION;        /*!< (@ 0x00000008) Start SHA-x operation depending on mode (start
                                                                    accepting data).                                           */
  __OM  uint32_t  TASKS_FINALIZE;               /*!< (@ 0x0000000C) Finalize SHA calculation.                                  */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x00000010) Stop all transfers and crypto operations (initialize).     */
  __IM  uint32_t  RESERVED[59];
  __IOM uint32_t  EVENTS_GATHER_STARTED;        /*!< (@ 0x00000100) Input DMA started.                                         */
  __IOM uint32_t  EVENTS_GATHER_DONE;           /*!< (@ 0x00000104) Input DMA done.                                            */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  EVENTS_SHA_READY;             /*!< (@ 0x0000010C) SHA calculated.                                            */
  __IOM uint32_t  EVENTS_MESSAGE_READY;         /*!< (@ 0x00000110) LENGTH == 0.                                               */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000114) Resetted (all transfers and crypto operations
                                                                    stopped).                                                  */
  __IM  uint32_t  RESERVED2[58];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED3[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED4[61];
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x00000400) Message length in bits.                                    */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Configuration.                                             */
  __IM  uint32_t  RESERVED5[126];
  __IM  uint32_t  H7;                           /*!< (@ 0x00000600) Final result H7 (SHA-256), H4 (SHA-1). Updated
                                                                    after every 512bit block calculated.                       */
  __IM  uint32_t  H6;                           /*!< (@ 0x00000604) Final result H6 (SHA-256), H3 (SHA-1). Updated
                                                                    after every 512bit block calculated.                       */
  __IM  uint32_t  H5;                           /*!< (@ 0x00000608) Final result H5 (SHA-256), H2 (SHA-1). Updated
                                                                    after every 512bit block calculated.                       */
  __IM  uint32_t  H4;                           /*!< (@ 0x0000060C) Final result H4 (SHA-256), H1 (SHA-1). Updated
                                                                    after every 512bit block calculated.                       */
  __IM  uint32_t  H3;                           /*!< (@ 0x00000610) Final result H3 (SHA-256), H0 (SHA-1). Updated
                                                                    after every 512bit block calculated.                       */
  __IM  uint32_t  H2;                           /*!< (@ 0x00000614) Final result H2 (SHA-256). Updated after every
                                                                    512bit block calculated.                                   */
  __IM  uint32_t  H1;                           /*!< (@ 0x00000618) Final result H1 (SHA-256). Updated after every
                                                                    512bit block calculated.                                   */
  __IM  uint32_t  H0;                           /*!< (@ 0x0000061C) Final result H0 (SHA-256). Updated after every
                                                                    512bit block calculated..                                  */
  __IM  uint32_t  RESERVED6[4];
  __IM  uint32_t  H7_R;                         /*!< (@ 0x00000630) Final result H7_R (SHA-256), H4_R (SHA-1) in
                                                                    reversed byte order. Updated after every
                                                                    512bit block calculated.                                   */
  __IM  uint32_t  H6_R;                         /*!< (@ 0x00000634) Final result H6_R (SHA-256), H3_R (SHA-1) in
                                                                    reversed byte order. Updated after every
                                                                    512bit block calculated.                                   */
  __IM  uint32_t  H5_R;                         /*!< (@ 0x00000638) Final result H5_R (SHA-256), H2_R (SHA-1) in
                                                                    reversed byte order. Updated after every
                                                                    512bit block calculated.                                   */
  __IM  uint32_t  H4_R;                         /*!< (@ 0x0000063C) Final result H4_R (SHA-256), H1_R (SHA-1) in
                                                                    reversed byte order. Updated after every
                                                                    512bit block calculated.                                   */
  __IM  uint32_t  H3_R;                         /*!< (@ 0x00000640) Final result H3_R (SHA-256), H0_R (SHA-1) in
                                                                    reversed byte order. Updated after every
                                                                    512bit block calculated.                                   */
  __IM  uint32_t  H2_R;                         /*!< (@ 0x00000644) Final result H2_R (SHA-256) in reversed byte
                                                                    order. Updated after every 512bit block
                                                                    calculated.                                                */
  __IM  uint32_t  H1_R;                         /*!< (@ 0x00000648) Final result H1_R (SHA-256) in reversed byte
                                                                    order. Updated after every 512bit block
                                                                    calculated.                                                */
  __IM  uint32_t  H0_R;                         /*!< (@ 0x0000064C) Final result H0_R (SHA-256) in reversed byte
                                                                    order. Updated after every 512bit block
                                                                    calculated..                                               */
  __IM  uint32_t  RESERVED7[64];
  __IM  uint32_t  INBYTECOUNT;                  /*!< (@ 0x00000750) Bytes transferred in current job.                          */
  __IM  uint32_t  RESERVED8[43];
  __OM  uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Input job pointer.                                         */
} NRF_SHA_Type;                                 /*!< Size = 2052 (0x804)                                                       */



/* =========================================================================================================================== */
/* ================                                         TLSAES_NS                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief AES cipher with ECB, CBC, CBC-MAC and CTR (TLSAES_NS)
  */

