adamkondraciuk/nrfx/mdk/nrf9120_modem.h
typedef struct {                                /*!< (@ 0x40051000) TLSAES_NS Structure                                        */
  __OM  uint32_t  TASKS_START_GATHER;           /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOP_GATHER;            /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_START_SCATTER;          /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOP_SCATTER;           /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZE_AES;         /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_FILL_AES_INPUT;         /*!< (@ 0x00000014) Transfer 8 bytes of input from DMA to AES core             */
  __OM  uint32_t  TASKS_AES_ENCRYPT;            /*!< (@ 0x00000018) Encrypt                                                    */
  __OM  uint32_t  TASKS_AES_DECRYPT;            /*!< (@ 0x0000001C) Decrypt                                                    */
  __OM  uint32_t  TASKS_DRAIN_AES_OUTPUT;       /*!< (@ 0x00000020) Transfer 8 bytes of output from AES core to DMA            */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x00000024) Stop all transfers and crypto operations (software
                                                                    reset)                                                     */
  __IM  uint32_t  RESERVED[54];
  __IOM uint32_t  EVENTS_GATHER_STARTED;        /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHER_DONE;           /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTER_STARTED;       /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTER_DONE;          /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_KEY_READY;             /*!< (@ 0x00000110) Key received (keybytes == 16)                              */
  __IOM uint32_t  EVENTS_IV_READY;              /*!< (@ 0x00000114) IV received (ivbytes == 16)                                */
  __IOM uint32_t  EVENTS_AES_INITIALIZED;       /*!< (@ 0x00000118) New keys (and IV) taken into use                           */
  __IOM uint32_t  EVENTS_AES_INPUT_FULL;        /*!< (@ 0x0000011C) 8 bytes of input stored to AES core                        */
  __IOM uint32_t  EVENTS_AES_DONE;              /*!< (@ 0x00000120) Encrypt/decrypt action ready                               */
  __IOM uint32_t  EVENTS_AES_OUTPUT_EMPTY;      /*!< (@ 0x00000124) 8 bytes of output read from AES core                       */
  __IOM uint32_t  EVENTS_MAC_READY;             /*!< (@ 0x00000128) CBC-MAC calculated                                         */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x0000012C) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED1[52];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED3[60];
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000400) Operation mode                                             */
  __IOM uint32_t  CTRBITS;                      /*!< (@ 0x00000404) Amount of counter bits used in the CTR mode                */
  __IOM uint32_t  KEYMODE;                      /*!< (@ 0x00000408) Selects which key is utilized in ciphering operations      */
  __IOM uint32_t  LENGTH;                       /*!< (@ 0x0000040C) Length of the CBC-MAC data to be authenticated             */
  __IM  uint32_t  RESERVED4[60];
  __IOM uint32_t  ENABLE;                       /*!< (@ 0x00000500) Enable/disable block                                       */
  __IM  uint32_t  RESERVED5[191];
  __IOM uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Pointer to the memory address containing the
                                                                    input job list                                             */
  __IM  uint32_t  RESERVED6[63];
  __IOM uint32_t  OUTJOBPTR;                    /*!< (@ 0x00000900) Pointer to the memory address containing the
                                                                    output job list                                            */
} NRF_AES_Type;                                 /*!< Size = 2308 (0x904)                                                       */



/* =========================================================================================================================== */
/* ================                                       DESCIPHER_NS                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief DES HW Accelerator (DESCIPHER_NS)
  */

typedef struct {                                /*!< (@ 0x40052000) DESCIPHER_NS Structure                                     */
  __OM  uint32_t  TASKS_START_GATHER;           /*!< (@ 0x00000000) Start input DMA                                            */
  __OM  uint32_t  TASKS_STOP_GATHER;            /*!< (@ 0x00000004) Stop input DMA                                             */
  __OM  uint32_t  TASKS_START_SCATTER;          /*!< (@ 0x00000008) Start output DMA                                           */
  __OM  uint32_t  TASKS_STOP_SCATTER;           /*!< (@ 0x0000000C) Stop output DMA                                            */
  __OM  uint32_t  TASKS_INITIALIZE_DES;         /*!< (@ 0x00000010) New keys (and IV) ready to be used, reset keybytes,
                                                                    ivbytes                                                    */
  __OM  uint32_t  TASKS_FILL_DES_INPUT;         /*!< (@ 0x00000014) Transfer 8 bytes of input from DMA to DES core             */
  __OM  uint32_t  TASKS_DES_ENCRYPT_1;          /*!< (@ 0x00000018) Starts DES encryption with keyset 1 ( input -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_DECRYPT_1;          /*!< (@ 0x0000001C) Starts DES decryption with keyset 1 ( input -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_ENCRYPT_2;          /*!< (@ 0x00000020) Starts DES encryption with keyset 2 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_DECRYPT_2;          /*!< (@ 0x00000024) Starts DES decryption with keyset 2 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_ENCRYPT_3;          /*!< (@ 0x00000028) Starts DES encryption with keyset 3 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DES_DECRYPT_3;          /*!< (@ 0x0000002C) Starts DES decryption with keyset 3 (output -&gt;
                                                                    output)                                                    */
  __OM  uint32_t  TASKS_DRAIN_DES_OUTPUT;       /*!< (@ 0x00000030) Transfer 8 bytes of output from DES core to DMA            */
  __OM  uint32_t  TASKS_RESET;                  /*!< (@ 0x00000034) Stop all transfers and crypto operations (software
                                                                    reset)                                                     */
  __IM  uint32_t  RESERVED[50];
  __IOM uint32_t  EVENTS_GATHER_STARTED;        /*!< (@ 0x00000100) Input DMA started                                          */
  __IOM uint32_t  EVENTS_GATHER_DONE;           /*!< (@ 0x00000104) Input DMA done                                             */
  __IOM uint32_t  EVENTS_SCATTER_STARTED;       /*!< (@ 0x00000108) Output DMA started                                         */
  __IOM uint32_t  EVENTS_SCATTER_DONE;          /*!< (@ 0x0000010C) Output DMA done                                            */
  __IOM uint32_t  EVENTS_KEY_1_READY;           /*!< (@ 0x00000110) Key #1 received (keybytes == 8)                            */
  __IOM uint32_t  EVENTS_KEY_3_READY;           /*!< (@ 0x00000114) Keys #1, #2 and #3 received (keybytes == 24)               */
  __IOM uint32_t  EVENTS_IV_READY;              /*!< (@ 0x00000118) IV received (ivbytes == 8)                                 */
  __IOM uint32_t  EVENTS_DES_INITIALIZED;       /*!< (@ 0x0000011C) New keys (and IV) taken into use                           */
  __IOM uint32_t  EVENTS_DES_INPUT_FULL;        /*!< (@ 0x00000120) 8 bytes of input stored to DES core                        */
  __IOM uint32_t  EVENTS_DES_DONE_1;            /*!< (@ 0x00000124) Action with key 1 ready                                    */
  __IOM uint32_t  EVENTS_DES_DONE_2;            /*!< (@ 0x00000128) Action with key 2 ready                                    */
  __IOM uint32_t  EVENTS_DES_DONE_3;            /*!< (@ 0x0000012C) Action with key 3 ready                                    */
  __IOM uint32_t  EVENTS_DES_OUTPUT_EMPTY;      /*!< (@ 0x00000130) 8 bytes of output read from DES core                       */
  __IOM uint32_t  EVENTS_RESETTED;              /*!< (@ 0x00000134) Resetted (all transfers and crypto operations
                                                                    stopped)                                                   */
  __IM  uint32_t  RESERVED1[50];
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED2[63];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  INTPEND;                      /*!< (@ 0x0000030C) Pending interrupts                                         */
  __IM  uint32_t  RESERVED3[61];
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000404) Mode: 0 == ECB, 1 == CBC                                   */
  __IM  uint32_t  RESERVED4[254];
  __IOM uint32_t  INJOBPTR;                     /*!< (@ 0x00000800) Input DMA job pointer register                             */
  __IM  uint32_t  RESERVED5[63];
  __IOM uint32_t  OUTJOBPTR;                    /*!< (@ 0x00000900) Output DMA job pointer register                            */
} NRF_DES_Type;                                 /*!< Size = 2308 (0x904)                                                       */



/* =========================================================================================================================== */
/* ================                                          IPC_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter Processor Communication (IPC_NS)
  */

