adamkondraciuk/nrfx/mdk/nrf9120_modem.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define NRF_FICR_NS_BASE            0x00FF0000UL
#define NRF_UICR_NS_BASE            0x00FF8000UL
#define NRF_TRACEDELAYREG_NS_BASE   0xD0000000UL
#define NRF_AMLI_NS_BASE            0x40000000UL
#define NRF_DCNF_NS_BASE            0x40000000UL
#define NRF_TRACEANDDEBUG_NS_BASE   0xE0080000UL
#define NRF_MWU_NS_BASE             0x40001000UL
#define NRF_MCPLL_NS_BASE           0x40010000UL
#define NRF_BBPLL_NS_BASE           0x40011000UL
#define NRF_RCOSC32K_NS_BASE        0x40012000UL
#define NRF_CLOCK_NS_BASE           0x40015000UL
#define NRF_POWER_NS_BASE           0x40015000UL
#define NRF_MODEMPERIPH_NS_BASE     0x40021000UL
#define NRF_UARTE_NS_BASE           0x40023000UL
#define NRF_TIMER1_NS_BASE          0x40024000UL
#define NRF_RTC_NS_BASE             0x40026000UL
#define NRF_LWDT_NS_BASE            0x40027000UL
#define NRF_SWDT_NS_BASE            0x40028000UL
#define NRF_RNG_NS_BASE             0x40029000UL
#define NRF_SIMIF_NS_BASE           0x4002A000UL
#define NRF_RAMBISTHUB_NS_BASE      0x4002B000UL
#define NRF_M2M0_NS_BASE            0x4002E000UL
#define NRF_M2M1_NS_BASE            0x4002F000UL
#define NRF_GPIOTE0_NS_BASE         0x40030000UL
#define NRF_GPIOTE1_NS_BASE         0x40031000UL
#define NRF_SECCONTROL_NS_BASE      0x40032000UL
#define NRF_TIMEMARKMUX_NS_BASE     0x40033000UL
#define NRF_P0_NS_BASE              0x40034000UL
#define NRF_TIMEREVENTSYNC_NS_BASE  0x40035000UL
#define NRF_GPIOTE2_NS_BASE         0x40037000UL
#define NRF_TEMP_NS_BASE            0x40039000UL
#define NRF_LFCLKCALIBMEAS_NS_BASE  0x4003B000UL
#define NRF_TWIM_NS_BASE            0x4003C000UL
#define NRF_CTRL_AP_PERI_S_BASE     0x4003D000UL
#define NRF_L2CIPHER_NS_BASE        0x40040000UL
#define NRF_AESL2_NS_BASE           0x40042000UL
#define NRF_SNOW_NS_BASE            0x40043000UL
#define NRF_ZUC_NS_BASE             0x40044000UL
#define NRF_SHA_NS_BASE             0x40050000UL
#define NRF_TLSAES_NS_BASE          0x40051000UL
#define NRF_DESCIPHER_NS_BASE       0x40052000UL
#define NRF_IPC_NS_BASE             0x40053000UL
#define NRF_TIMER0_NS_BASE          0x40056000UL
#define NRF_ACL_NS_BASE             0x40060000UL
#define NRF_KMU_NS_BASE             0x40060000UL
#define NRF_NVMC_NS_BASE            0x40060000UL
#define NRF_VMC_NS_BASE             0x40061000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define NRF_FICR_NS                 ((NRF_FICR_Type*)          NRF_FICR_NS_BASE)
#define NRF_UICR_NS                 ((NRF_UICR_Type*)          NRF_UICR_NS_BASE)
#define NRF_TRACEDELAYREG_NS        ((NRF_TRACEDELAYREG_Type*)  NRF_TRACEDELAYREG_NS_BASE)
#define NRF_AMLI_NS                 ((NRF_AMLI_Type*)          NRF_AMLI_NS_BASE)
#define NRF_DCNF_NS                 ((NRF_DCNF_Type*)          NRF_DCNF_NS_BASE)
#define NRF_TRACEANDDEBUG_NS        ((NRF_TRACEANDDEBUG_Type*)  NRF_TRACEANDDEBUG_NS_BASE)
#define NRF_MWU_NS                  ((NRF_MWU_Type*)           NRF_MWU_NS_BASE)
#define NRF_MCPLL_NS                ((NRF_MCPLL_Type*)         NRF_MCPLL_NS_BASE)
#define NRF_BBPLL_NS                ((NRF_BBPLL_Type*)         NRF_BBPLL_NS_BASE)
#define NRF_RCOSC32K_NS             ((NRF_RCOSC32K_Type*)      NRF_RCOSC32K_NS_BASE)
#define NRF_CLOCK_NS                ((NRF_CLOCK_Type*)         NRF_CLOCK_NS_BASE)
#define NRF_POWER_NS                ((NRF_POWER_Type*)         NRF_POWER_NS_BASE)
#define NRF_MODEMPERIPH_NS          ((NRF_MODEMPERIPH_Type*)   NRF_MODEMPERIPH_NS_BASE)
#define NRF_UARTE_NS                ((NRF_UARTE_Type*)         NRF_UARTE_NS_BASE)
#define NRF_TIMER1_NS               ((NRF_MODEMTIMER_Type*)    NRF_TIMER1_NS_BASE)
#define NRF_RTC_NS                  ((NRF_RTC_Type*)           NRF_RTC_NS_BASE)
#define NRF_LWDT_NS                 ((NRF_WDT_Type*)           NRF_LWDT_NS_BASE)
#define NRF_SWDT_NS                 ((NRF_WDT_Type*)           NRF_SWDT_NS_BASE)
#define NRF_RNG_NS                  ((NRF_RNG_Type*)           NRF_RNG_NS_BASE)
#define NRF_SIMIF_NS                ((NRF_SIMIF_Type*)         NRF_SIMIF_NS_BASE)
#define NRF_RAMBISTHUB_NS           ((NRF_RAMBISTHUB_Type*)    NRF_RAMBISTHUB_NS_BASE)
#define NRF_M2M0_NS                 ((NRF_M2M_Type*)           NRF_M2M0_NS_BASE)
#define NRF_M2M1_NS                 ((NRF_M2M_Type*)           NRF_M2M1_NS_BASE)
#define NRF_GPIOTE0_NS              ((NRF_GPIOTE_Type*)        NRF_GPIOTE0_NS_BASE)
#define NRF_GPIOTE1_NS              ((NRF_GPIOTE_Type*)        NRF_GPIOTE1_NS_BASE)
#define NRF_SECCONTROL_NS           ((NRF_SECURECONTROL_Type*)  NRF_SECCONTROL_NS_BASE)
#define NRF_TIMEMARKMUX_NS          ((NRF_TIMEMARKMUX_Type*)   NRF_TIMEMARKMUX_NS_BASE)
#define NRF_P0_NS                   ((NRF_GPIO_Type*)          NRF_P0_NS_BASE)
#define NRF_TIMEREVENTSYNC_NS       ((NRF_TIMEREVENTSYNC_Type*)  NRF_TIMEREVENTSYNC_NS_BASE)
#define NRF_GPIOTE2_NS              ((NRF_GPIOTE_Type*)        NRF_GPIOTE2_NS_BASE)
#define NRF_TEMP_NS                 ((NRF_TEMP_Type*)          NRF_TEMP_NS_BASE)
#define NRF_LFCLKCALIBMEAS_NS       ((NRF_LFCLKCALIBMEAS_Type*)  NRF_LFCLKCALIBMEAS_NS_BASE)
#define NRF_TWIM_NS                 ((NRF_TWIM_Type*)          NRF_TWIM_NS_BASE)
#define NRF_CTRL_AP_PERI_S          ((NRF_CTRLAPPERI_Type*)    NRF_CTRL_AP_PERI_S_BASE)
#define NRF_L2CIPHER_NS             ((NRF_L2CIPHER_Type*)      NRF_L2CIPHER_NS_BASE)
#define NRF_AESL2_NS                ((NRF_AESL2_Type*)         NRF_AESL2_NS_BASE)
#define NRF_SNOW_NS                 ((NRF_SNOW_Type*)          NRF_SNOW_NS_BASE)
#define NRF_ZUC_NS                  ((NRF_ZUC_Type*)           NRF_ZUC_NS_BASE)
#define NRF_SHA_NS                  ((NRF_SHA_Type*)           NRF_SHA_NS_BASE)
#define NRF_TLSAES_NS               ((NRF_AES_Type*)           NRF_TLSAES_NS_BASE)
#define NRF_DESCIPHER_NS            ((NRF_DES_Type*)           NRF_DESCIPHER_NS_BASE)
#define NRF_IPC_NS                  ((NRF_IPC_Type*)           NRF_IPC_NS_BASE)
#define NRF_TIMER0_NS               ((NRF_MODEMTIMER_Type*)    NRF_TIMER0_NS_BASE)
#define NRF_ACL_NS                  ((NRF_ACL_Type*)           NRF_ACL_NS_BASE)
#define NRF_KMU_NS                  ((NRF_KMU_Type*)           NRF_KMU_NS_BASE)
#define NRF_NVMC_NS                 ((NRF_NVMC_Type*)          NRF_NVMC_NS_BASE)
#define NRF_VMC_NS                  ((NRF_VMC_Type*)           NRF_VMC_NS_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


#ifdef __cplusplus
}
#endif

#endif /* NRF9120_MODEM_H */


/** @} */ /* End of group nrf9120_modem */

/** @} */ /* End of group Nordic Semiconductor */
